# TITLE: Runtime initialization Examples 

The following examples illustrate situations where unchecked code can expose
objects whose invariants have not yet been established. These scenarios motivate
runtime initialization checks in a gradual type system that combines checked
and unchecked code.

Two (maybe 3?)  distinct kinds of initialization guarantees are relevant:

**Shallow initialization**

Shallow initialization concerns the *receiver object itself*.  
A shallow initialization violation occurs when a reference to an object is used
before the object's own invariants have been established.

In these cases, the object itself is still under construction and its fields may
not yet satisfy their declared invariants.

**Deep initialization**

Deep initialization extends the guarantee transitively to objects reachable
through fields. If an object is considered initialized, then any references
stored in its invariant fields should also point to initialized objects.

Think forward reachability

**Global initialization??**

if x is committed then objects pointing to x must also be committed

Think forward + reverse reachability

KeyFor?
is ownership global?
can you extend JOL for uniqueness

* Example 1: Instance method invoked during construction where the receiver must be fully initialized

This example demonstrates a classic Java hazard: a superclass constructor invokes a method
that is overridden in a subclass. Because method dispatch is virtual, the subclass method
may execute before the subclass constructor has established its invariants.

#+BEGIN_SRC javac :classname Unchecked :dir /tmp/cf-init-demo
  public class Unchecked {
      public Unchecked() {
  	init();           
      }
      protected void init() { }
  }
#+END_SRC

#+RESULTS:
: OK: javac /tmp/cf-init-demo/Unchecked.java 2>&1


 #+BEGIN_SRC checker-javac :classname Checked :dir /tmp/cf-init-demo :sources "Unchecked.java" :flags "-processor org.checkerframework.checker.nullness.NullnessChecker"
   import org.checkerframework.checker.nullness.qual.NonNull;

   public class Checked extends Unchecked {
       @NonNull String name;

       public Checked(String n) {
   	super();            
   	this.name = n;
       }

       @Override protected void init() {
   	// expects fully initialized receiver
   	// the implicit 'this' is technically non-null so a runtime null check
   	// doesn't help here
   	// you could either inject a check in an override such as:
   	// RuntimeInitChecks.assertInitialized(this);
   	// or similar to bworld, enforce super calls after fields are initialized
   	System.out.println(name.length());
       }

       public static void main(String[] args) {
   	Checked willFail = new Checked("test");
       }    
   }
#+END_SRC

#+RESULTS:
: FAILED (/home/alex/eisop/checker-framework/checker/bin/javac -processor org.checkerframework.checker.nullness.NullnessChecker /tmp/cf-init-demo/Checked.java /tmp/cf-init-demo/Unchecked.java 2>&1)
: /tmp/cf-init-demo/Unchecked.java:3: error: [method.invocation.invalid] call to init() not allowed on the given receiver.
:         init();
:             ^
:   found   : @UnderInitialization(Unchecked.class) Unchecked
:   required: @Initialized Unchecked
: 1 error


